In [5]:
import pandas as pd
import numpy as ny

In [6]:
a=pd.DataFrame({'a':[12,23,34,34,43],'b':[23,65,75,75,'hello'],'c':[23,45,75,84,35]})
a

    a      b   c
0  12     23  23
1  23     65  45
2  34     75  75
3  34     75  84
4  43  hello  35

In [11]:
a1=pd.DataFrame([23,45,56,65,34],columns=['marks'])
a1

   marks
0     23
1     45
2     56
3     65
4     34

In [12]:
a3=pd.DataFrame({'name':['nikhil','kamalu','adarsh'],'city':['paplah','badarta','palampur'],'marks':[56,64,87],'age':[18,19,17]})
a3

     name      city  marks  age
0  nikhil    paplah     56   18
1  kamalu   badarta     64   19
2  adarsh  palampur     87   17

In [ ]:
a3.loc[:1,:'city']  # rows  and columns

     name     city
0  nikhil   paplah
1  kamalu  badarta

In [ ]:
a3.iloc[:1,:1]

     name
0  nikhil

In [ ]:
a3.iloc[:1,:]  # rows  and columns

     name    city  marks  age
0  nikhil  paplah     56   18

In [ ]:
a3.iloc[:3,:1]

     name
0  nikhil
1  kamalu
2  adarsh

In [40]:
a3.loc[:1,['name','marks']]

     name  marks
0  nikhil     56
1  kamalu     64

In [43]:
# update and add
a3.loc[:1,'marks']=78
a3

     name      city  marks  age
0  nikhil    paplah     78   18
1  kamalu   badarta     78   19
2  adarsh  palampur     87   17

In [46]:
a3.loc[:,'ph no']=23432324,32423432,43234234
a3

     name      city  marks  age     ph no
0  nikhil    paplah     78   18  23432324
1  kamalu   badarta     78   19  32423432
2  adarsh  palampur     87   17  43234234

In [48]:
a3.drop('city',axis=1,inplace=False)

     name  marks  age     ph no
0  nikhil     78   18  23432324
1  kamalu     78   19  32423432
2  adarsh     87   17  43234234